In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

In [2]:
ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [3]:
ser

1  a    0.029826
   b   -1.221187
   c    0.976519
2  a    1.580302
   b    1.813644
   c    0.261580
dtype: float64

In [5]:
ser.index

MultiIndex(levels=[[1, 2], [u'a', u'b', u'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [6]:
ser[1]

a    0.029826
b   -1.221187
c    0.976519
dtype: float64

In [7]:
ser[2]

a    1.580302
b    1.813644
c    0.261580
dtype: float64

In [8]:
ser[:,'a']

1    0.029826
2    1.580302
dtype: float64

In [9]:
df = ser.unstack()

In [10]:
df

          a         b         c
1  0.029826 -1.221187  0.976519
2  1.580302  1.813644  0.261580

In [12]:
df2 = DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]],columns=[['NY','CA','LA','TX'],
                                                                                        ['cold','cold','hot','hot']])

In [13]:
df2

      NY   CA  LA  TX
    cold cold hot hot
a 1    0    1   2   3
  2    4    5   6   7
b 1    8    9  10  11
  2   12   13  14  15

In [14]:
df2.index.names = ['id1','id2']
df2.columns.names = ['cities','temp']

In [15]:
df2

cities    NY   CA  LA  TX
temp    cold cold hot hot
id1 id2
a   1      0    1   2   3
    2      4    5   6   7
b   1      8    9  10  11
    2     12   13  14  15

In [16]:
df2.swaplevel('cities','temp',axis=1)

temp    cold     hot
cities    NY  CA  LA  TX
id1 id2
a   1      0   1   2   3
    2      4   5   6   7
b   1      8   9  10  11
    2     12  13  14  15

In [18]:
df2.sortlevel(1)

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

cities    NY   CA  LA  TX
temp    cold cold hot hot
id1 id2
a   1      0    1   2   3
b   1      8    9  10  11
a   2      4    5   6   7
b   2     12   13  14  15

In [19]:
df2.sum(level='temp',axis=1)

temp     cold  hot
id1 id2
a   1       1    5
    2       9   13
b   1      17   21
    2      25   29